micropython/micropython/ports/wch/bsp/src/ch32v30x_adc.c
    itmask = (uint8_t)(ADC_IT >> 8);
    ADCx->STATR = ~(uint32_t)itmask;
}

/*********************************************************************
 * @fn      TempSensor_Volt_To_Temper
 *
 * @brief   Internal Temperature Sensor Voltage to temperature.
 *
 * @param   Value - Voltage Value(mv).
 *
 * @return  Temper - Temperature Value.
 */
s32 TempSensor_Volt_To_Temper(s32 Value) {
    s32 Temper, Refer_Volt, Refer_Temper;
    s32 k = 43;

    Refer_Volt = (s32)((*(u32 *)0x1FFFF720) & 0x0000FFFF);
    Refer_Temper = (s32)(((*(u32 *)0x1FFFF720) >> 16) & 0x0000FFFF);

    Temper = Refer_Temper + ((Value - Refer_Volt) * 10 + (k >> 1)) / k;

    return Temper;
}

/*********************************************************************
 * @fn      ADC_BufferCmd
 *
 * @brief   Enables or disables the ADCx buffer.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_BufferCmd(ADC_TypeDef *ADCx, FunctionalState NewState) {
    if (NewState != DISABLE) {
        ADCx->CTLR1 |= (1 << 26);
    } else {
        ADCx->CTLR1 &= ~(1 << 26);
    }
}

/*********************************************************************
 * @fn      Get_CalibrationValue
 *
 * @brief   Get ADCx Calibration Value.
 *
 * @param   ADCx - where x can be 1 or 2 to select the ADC peripheral.
 *
 * @return  CalibrationValue
 */
int16_t Get_CalibrationValue(ADC_TypeDef *ADCx) {
    __IO uint8_t i, j;
    uint16_t buf[10];
    __IO uint16_t t;

    for (i = 0; i < 10; i++)
    {
        ADC_ResetCalibration(ADCx);
        while (ADC_GetResetCalibrationStatus(ADCx)) {
            ;
        }
        ADC_StartCalibration(ADCx);
        while (ADC_GetCalibrationStatus(ADCx)) {
            ;
        }
        buf[i] = ADCx->RDATAR;
    }

    for (i = 0; i < 10; i++)
    {
        for (j = 0; j < 10; j++)
        {
            if (buf[j] > buf[j + 1]) {
                t = buf[j];
                buf[j] = buf[j + 1];
                buf[j] = t;
            }
        }
    }

    t = 0;
    for (i = 0; i < 6; i++)
    {
        t += buf[i + 2];
    }

    t = (t / 6) + ((t % 6) / 3);

    return (int16_t)(2048 - (int16_t)t);
}
